import { Component } from '@angular/core';

export interface needHelpTabsData {
  title: string;
  text: string;
  linkTo?: string;
  active?: boolean;
}

@Component({
  selector: 'app-root',
  templateUrl: './app.component.html',
  styleUrls: ['./app.component.css'],
})
export class AppComponent {
  activeTab!: needHelpTabsData;
  tabsArray: needHelpTabsData[] = [
    {
      title: "я турбуюся про свою пам'ять",
      text: '<div><p class="mb-7">Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/i-worry-about-memory',
    },
    {
      title: 'щойно встановили діагноз',
      text: '<div><p class="mb-7">2Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/just-diagnosed',
    },
    {
      title: 'у родича деменція',
      text: '<div><p class="mb-7">3Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/relative-has-dementia',
    },
    {
      title: 'я маю деменцію',
      text: '<div><p class="mb-7">4Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/i-live-with-dementia',
    },
    {
      title: 'я професійний доглядальник',
      text: '<div><p class="mb-7">5Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/professional-caregiver',
    },
    {
      title: 'я медичний співробітник',
      text: '<div><p class="mb-7">6Тут ви дізнаєтеся про те, як зрозуміти, чи розвивається у вас деменція чи ні; та що робити щоб запобігти появі деменції. причини погіршення пам\'яті, відмінність ознак нормального перебігу старіння від ознак деменції, а також як впоратися з погіршенням пам\'яті у себе чи близької людини.</p><p class="mb-7">Кожна людина час від часу може щось забувати, і зазвичай це нормально. Але якщо проблеми з пам’яттю впливають на ваше повсякденне життя, краще звернутися до лікаря загальної практики.</p><p class="mb-7">Втрата пам\'яті є однією з поширених ознак деменції, яка виникає унаслідок захворювань, що пошкоджують роботу мозку. Це пошкодження часто вражає ділянки мозку, які беруть участь у створенні нових спогадів і запам’ятовуванні старих. Однак деменція може проявлятися й через інші симптоми, що можуть виникати раніше за погіршення пам\'яті, зокрема дезорієнтація, депресія тощо.</p></div>',
      linkTo: '/need-help/what-to-do-if/medical-employee',
    },
  ];
  constructor() {}

  ngOnInit(): void {
    this.activeTab = this.tabsArray[0];
    this.activeTab.active = true;
    this.setTabData(this.activeTab);
  }

  public selectItem(tab: needHelpTabsData) {
    console.log(tab)
    this.tabsArray.forEach((tab) => {
      tab.active = false;
    });
    tab.active = true;
    this.setTabData(tab);
  }

  setTabData(tab: any) {
    this.activeTab = tab;
  }
}
